docs/tutorials/expressions.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-11-21 Mon 15:39 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Tutorial: Modulus Expressions</title>
<meta name="author" content="Connor Redfern" />
<meta name="generator" content="Org Mode" />

<link rel="stylesheet" href="../modulus-style.css" type="text/css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Tutorial: Modulus Expressions</h1>
<div style="text-align:right">
<p>
<a href="file:///f:/Home/wiki/mlsio/index.html">Modulus</a> / <a href="index.html">Tutorials</a> / Expressions
</p>
</div>

<div id="outline-container-org4cc6ee0" class="outline-2">
<h2 id="org4cc6ee0">Arithmetic</h2>
<div class="outline-text-2" id="text-org4cc6ee0">
<p>
&lt;TODO: brief tooling&gt;
</p>

<p>
When Programming, we often 
</p>

<div class="org-src-container">
<pre class="src src-modulus">&gt; <span style="color: #cea2ca;">2</span> + <span style="color: #cea2ca;">3</span>
<span style="color: #cea2ca;">5</span>
&gt; <span style="color: #cea2ca;">6</span> - <span style="color: #cea2ca;">5</span>
<span style="color: #cea2ca;">1</span>
&gt; <span style="color: #cea2ca;">1.5</span> &#215; <span style="color: #cea2ca;">2.0</span>
<span style="color: #cea2ca;">3.0</span>
</pre>
</div>

<p>
Shown above are a few arithmetic operations. Modulus for the most part looks
like other programming languages, except for the `×' symbol, used for
multiplication. Modulus offers two options for entering characters like
this. The first is to preceed the name of the operation with a colon, in this
case typing <code>:times</code> will output `×'. The other is abbreviated input, where
you use a semicolon. The abbreviated input for `×' is <code>;xx</code>.
</p>
</div>
</div>

<div id="outline-container-org0217ed7" class="outline-2">
<h2 id="org0217ed7">Booleans, Conditionals</h2>
<div class="outline-text-2" id="text-org0217ed7">
<p>
Booleans are values which can be either true or false. The easiest way to get a
boolean is to just write <code>true</code> or <code>false</code>: 
</p>

<div class="org-src-container">
<pre class="src src-modulus">&gt; <span style="color: #cea2ca;">true</span>
<span style="color: #cea2ca;">true</span>
&gt; <span style="color: #cea2ca;">false</span>
<span style="color: #cea2ca;">false</span>
</pre>
</div>

<p>
More practically, booleans can be returned via comparison operations like <code>&lt;</code>
and <code>&gt;</code>.
</p>

<div class="org-src-container">
<pre class="src src-modulus">&gt; <span style="color: #807f96;">(</span><span style="color: #cea2ca;">2</span> &lt; <span style="color: #cea2ca;">3</span><span style="color: #807f96;">)</span> <span style="color: #545c5e;">;; </span><span style="color: #545c5e;">less than</span>
<span style="color: #cea2ca;">true</span>
&gt; <span style="color: #807f96;">(</span><span style="color: #cea2ca;">2</span> &#8804; <span style="color: #cea2ca;">3</span><span style="color: #807f96;">)</span> <span style="color: #545c5e;">;; </span><span style="color: #545c5e;">less than or equal to ;&lt;= </span>
<span style="color: #cea2ca;">true</span>
&gt; <span style="color: #807f96;">(</span><span style="color: #cea2ca;">2</span> = <span style="color: #cea2ca;">3</span><span style="color: #807f96;">)</span> <span style="color: #545c5e;">;; </span><span style="color: #545c5e;">equal to</span>
<span style="color: #cea2ca;">false</span>
&gt; <span style="color: #807f96;">(</span><span style="color: #cea2ca;">2</span> &#8800; <span style="color: #cea2ca;">3</span><span style="color: #807f96;">)</span> <span style="color: #545c5e;">;; </span><span style="color: #545c5e;">not equal to (;/= :not=)</span>
<span style="color: #cea2ca;">true</span>
&gt; <span style="color: #807f96;">(</span><span style="color: #cea2ca;">5</span> &gt; <span style="color: #cea2ca;">3</span><span style="color: #807f96;">)</span> <span style="color: #545c5e;">;; </span><span style="color: #545c5e;">greater than</span>
<span style="color: #cea2ca;">true</span>
&gt; <span style="color: #807f96;">(</span><span style="color: #cea2ca;">3</span> &#8805; <span style="color: #cea2ca;">3</span><span style="color: #807f96;">)</span> <span style="color: #545c5e;">;; </span><span style="color: #545c5e;">greater than or equal to ;&gt;= </span>
<span style="color: #cea2ca;">true</span>
</pre>
</div>



<p>
There are also functions to combine booleans:  
</p>

<div class="org-src-container">
<pre class="src src-modulus">&gt; <span style="color: #807f96;">(</span><span style="color: #cea2ca;">true</span> &#8744; <span style="color: #cea2ca;">false</span><span style="color: #807f96;">)</span> <span style="color: #545c5e;">;; </span><span style="color: #545c5e;">or (;v, :or) is true if either argument is true  </span>
<span style="color: #cea2ca;">true</span>
&gt; <span style="color: #807f96;">(</span><span style="color: #cea2ca;">true</span> &#8743; <span style="color: #cea2ca;">false</span><span style="color: #807f96;">)</span> <span style="color: #545c5e;">;; </span><span style="color: #545c5e;">and (;^, :and) is true only when both arguments ar etrue</span>
<span style="color: #cea2ca;">false</span>
&gt; <span style="color: #807f96;">(</span><span style="color: #cea2ca;">true</span> = <span style="color: #cea2ca;">false</span><span style="color: #807f96;">)</span>
<span style="color: #cea2ca;">false</span>
&gt; <span style="color: #807f96;">(</span><span style="color: #cea2ca;">true</span> &#8800; <span style="color: #cea2ca;">false</span><span style="color: #807f96;">)</span>
<span style="color: #cea2ca;">true</span>
</pre>
</div>


<p>
So that's all about how we <i>produce</i> a boolean, but how to we <i>use</i> them?  The
simplest way is to use <code>if</code>, which takes three arguments: a boolean, an
expression which is evaluated when the boolean is true, and an expression is
evaluated when the boolean is false.
</p>

<div class="org-src-container">
<pre class="src src-modulus">&gt; <span style="color: #807f96;">(</span><span style="color: #738FD7;">if</span> <span style="color: #cea2ca;">true</span> <span style="color: #7CF083;">"when-true"</span> <span style="color: #7CF083;">"when-false"</span><span style="color: #807f96;">)</span>
two
&gt; <span style="color: #807f96;">(</span><span style="color: #738FD7;">if</span> <span style="color: #9d81ba;">(</span><span style="color: #cea2ca;">3</span> &lt; <span style="color: #cea2ca;">2</span><span style="color: #9d81ba;">)</span> <span style="color: #7CF083;">"when-true"</span> <span style="color: #7CF083;">"when-false"</span><span style="color: #807f96;">)</span>
when-false
</pre>
</div>
</div>
</div>

<div id="outline-container-org17f88cd" class="outline-2">
<h2 id="org17f88cd">Naming Values</h2>
</div>



<div id="outline-container-org71de992" class="outline-2">
<h2 id="org71de992">Arrays</h2>
<div class="outline-text-2" id="text-org71de992">
<p>
Modulus also allows you to group data together into structures called <i>arrays</i>,
which are like a list of values. You write arrays as a list of values between
'tortoise' brackets <code>⦗⦘</code>, which you type as <code>;[​[</code> and <code>;]​]</code>. For example, you
could construct the array <code>⦗1 2 3⦘</code>.
</p>

<p>
Arrays must contain elements which all have the same 'type'. A type is like a
category of things. Two common types are the type of Integers (whole numbers),
or the type of strings (words). This means that <code>⦗1 2 3⦘</code> and <code>⦗"apple"
"bannana" "orange"⦘</code> are valid arrays, but <code>⦗2 "apple" 10⦘</code> is not.
</p>

<p>
It's cool to be able to make an array, but what can we <i>do</i> with them? For a
start, we can join them together with <i>append</i>, (also written `⋅' (<code>;**</code>)).
</p>

<div class="org-src-container">
<pre class="src src-modulus">&gt; <span style="color: #807f96;">&#10647;</span><span style="color: #cea2ca;">1</span> <span style="color: #cea2ca;">2</span> <span style="color: #cea2ca;">3</span><span style="color: #807f96;">&#10648;</span> &#8901; <span style="color: #807f96;">&#10647;</span><span style="color: #cea2ca;">4</span> <span style="color: #cea2ca;">5</span> <span style="color: #cea2ca;">6</span><span style="color: #807f96;">&#10648;</span>
<span style="color: #807f96;">&#10647;</span><span style="color: #cea2ca;">1</span> <span style="color: #cea2ca;">2</span> <span style="color: #cea2ca;">3</span> <span style="color: #cea2ca;">4</span> <span style="color: #cea2ca;">5</span> <span style="color: #cea2ca;">6</span><span style="color: #807f96;">&#10648;</span>
&gt; append <span style="color: #807f96;">&#10647;</span><span style="color: #cea2ca;">1</span> <span style="color: #cea2ca;">2</span> <span style="color: #cea2ca;">3</span><span style="color: #807f96;">&#10648;</span> <span style="color: #807f96;">&#10647;</span><span style="color: #cea2ca;">4</span> <span style="color: #cea2ca;">5</span> <span style="color: #cea2ca;">6</span><span style="color: #807f96;">&#10648;</span>
<span style="color: #807f96;">&#10647;</span><span style="color: #cea2ca;">1</span> <span style="color: #cea2ca;">2</span> <span style="color: #cea2ca;">3</span> <span style="color: #cea2ca;">4</span> <span style="color: #cea2ca;">5</span> <span style="color: #cea2ca;">6</span><span style="color: #807f96;">&#10648;</span>
</pre>
</div>



<div class="org-src-container">
<pre class="src src-modulus">&gt; <span style="color: #738FD7;">defn</span> add1 <span style="color: #807f96;">[</span>x<span style="color: #807f96;">]</span> <span style="color: #807f96;">(</span>x + <span style="color: #cea2ca;">1</span><span style="color: #807f96;">)</span>
&gt; map add1 <span style="color: #807f96;">&#10647;</span><span style="color: #cea2ca;">1</span> <span style="color: #cea2ca;">2</span> <span style="color: #cea2ca;">3</span><span style="color: #807f96;">&#10648;</span>
<span style="color: #807f96;">&#10647;</span><span style="color: #cea2ca;">2</span> <span style="color: #cea2ca;">3</span> <span style="color: #cea2ca;">4</span><span style="color: #807f96;">&#10648;</span>
</pre>
</div>

<pre class="example">
&gt; map (+ 1) ⦗1 2 3⦘
⦗2 3 4⦘
</pre>

<pre class="example">
&gt; (+ 1) ¨ ⦗1 2 3⦘
⦗2 3 4⦘
</pre>


<div class="org-src-container">
<pre class="src src-modulus">&gt; <span style="color: #738FD7;">defn</span> add <span style="color: #807f96;">[</span>x y<span style="color: #807f96;">]</span> <span style="color: #807f96;">(</span>x + y<span style="color: #807f96;">)</span>
&gt; fold add <span style="color: #cea2ca;">0</span> <span style="color: #807f96;">&#10647;</span><span style="color: #cea2ca;">1</span> <span style="color: #cea2ca;">2</span> <span style="color: #cea2ca;">3</span><span style="color: #807f96;">&#10648;</span>
<span style="color: #cea2ca;">6</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-modulus">&gt; fold <span style="color: #807f96;">(</span>+<span style="color: #807f96;">)</span> <span style="color: #cea2ca;">0</span> <span style="color: #807f96;">&#10647;</span><span style="color: #cea2ca;">1</span> <span style="color: #cea2ca;">2</span> <span style="color: #cea2ca;">3</span><span style="color: #807f96;">&#10648;</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-modulus">&gt; <span style="color: #807f96;">(</span><span style="color: #9d81ba;">(</span>+<span style="color: #9d81ba;">)</span> / <span style="color: #cea2ca;">0</span><span style="color: #807f96;">)</span> <span style="color: #807f96;">&#10647;</span><span style="color: #cea2ca;">1</span> <span style="color: #cea2ca;">2</span> <span style="color: #cea2ca;">3</span><span style="color: #807f96;">&#10648;</span>
</pre>
</div>


<div class="org-src-container">
<pre class="src src-modulus">&gt; <span style="color: #807f96;">(</span>+ / <span style="color: #cea2ca;">0</span><span style="color: #807f96;">)</span> <span style="color: #807f96;">&#10647;</span><span style="color: #cea2ca;">1</span> <span style="color: #cea2ca;">2</span> <span style="color: #cea2ca;">3</span><span style="color: #807f96;">&#10648;</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-modulus">&gt; + <span style="color: #807f96;">&#10216;</span>/ <span style="color: #cea2ca;">0</span><span style="color: #807f96;">&#10217;</span> <span style="color: #807f96;">&#10647;</span><span style="color: #cea2ca;">1</span> <span style="color: #cea2ca;">2</span> <span style="color: #cea2ca;">3</span><span style="color: #807f96;">&#10648;</span>
</pre>
</div>
</div>

<div id="outline-container-orgc6f9cfc" class="outline-3">
<h3 id="orgc6f9cfc">Useful Array functions</h3>
<div class="outline-text-3" id="text-orgc6f9cfc">
<p>
filter
</p>

<div class="org-src-container">
<pre class="src src-modulus">&gt; <span style="color: #738FD7;">defn</span> even? <span style="color: #807f96;">[</span>n<span style="color: #807f96;">]</span> <span style="color: #807f96;">(</span>n | <span style="color: #cea2ca;">2</span> = <span style="color: #cea2ca;">0</span><span style="color: #807f96;">)</span>
<span style="color: #807f96;">&#10647;</span><span style="color: #cea2ca;">1</span> <span style="color: #cea2ca;">2</span> <span style="color: #cea2ca;">3</span><span style="color: #807f96;">&#10648;</span> <span style="color: #807f96;">&#10216;</span>&#9673; ,<span style="color: #807f96;">&#10217;</span> <span style="color: #807f96;">&#10647;</span><span style="color: #d24b83;">&#8278;a</span> <span style="color: #d24b83;">&#8278;b</span> <span style="color: #d24b83;">&#8278;c</span><span style="color: #807f96;">&#10648;</span>
&gt; <span style="color: #807f96;">&#10647;</span><span style="color: #9d81ba;">&#10647;</span><span style="color: #cea2ca;">1</span> <span style="color: #d24b83;">&#8278;a</span><span style="color: #9d81ba;">&#10648;</span> <span style="color: #9d81ba;">&#10647;</span><span style="color: #cea2ca;">1</span> <span style="color: #d24b83;">&#8278;b</span><span style="color: #9d81ba;">&#10648;</span> <span style="color: #9d81ba;">&#10647;</span><span style="color: #cea2ca;">1</span> <span style="color: #d24b83;">&#8278;c</span><span style="color: #9d81ba;">&#10648;</span>
   <span style="color: #9d81ba;">&#10647;</span><span style="color: #cea2ca;">2</span> <span style="color: #d24b83;">&#8278;a</span><span style="color: #9d81ba;">&#10648;</span> <span style="color: #9d81ba;">&#10647;</span><span style="color: #cea2ca;">2</span> <span style="color: #d24b83;">&#8278;b</span><span style="color: #9d81ba;">&#10648;</span> <span style="color: #9d81ba;">&#10647;</span><span style="color: #cea2ca;">2</span> <span style="color: #d24b83;">&#8278;c</span><span style="color: #9d81ba;">&#10648;</span>
   <span style="color: #9d81ba;">&#10647;</span><span style="color: #cea2ca;">3</span> <span style="color: #d24b83;">&#8278;a</span><span style="color: #9d81ba;">&#10648;</span> <span style="color: #9d81ba;">&#10647;</span><span style="color: #cea2ca;">3</span> <span style="color: #d24b83;">&#8278;b</span><span style="color: #9d81ba;">&#10648;</span> <span style="color: #9d81ba;">&#10647;</span><span style="color: #cea2ca;">3</span> <span style="color: #d24b83;">&#8278;c</span><span style="color: #9d81ba;">&#10648;</span><span style="color: #807f96;">&#10648;</span>
</pre>
</div>

<p>
filter
</p>

<div class="org-src-container">
<pre class="src src-modulus"><span style="color: #807f96;">&#10647;</span><span style="color: #cea2ca;">1</span> <span style="color: #cea2ca;">2</span> <span style="color: #cea2ca;">3</span><span style="color: #807f96;">&#10648;</span> <span style="color: #807f96;">&#10216;</span>&#9673; ,<span style="color: #807f96;">&#10217;</span> <span style="color: #807f96;">&#10647;</span><span style="color: #d24b83;">&#8278;a</span> <span style="color: #d24b83;">&#8278;b</span> <span style="color: #d24b83;">&#8278;c</span><span style="color: #807f96;">&#10648;</span>
&gt; <span style="color: #807f96;">&#10647;</span><span style="color: #9d81ba;">&#10647;</span><span style="color: #cea2ca;">1</span> <span style="color: #d24b83;">&#8278;a</span><span style="color: #9d81ba;">&#10648;</span> <span style="color: #9d81ba;">&#10647;</span><span style="color: #cea2ca;">1</span> <span style="color: #d24b83;">&#8278;b</span><span style="color: #9d81ba;">&#10648;</span> <span style="color: #9d81ba;">&#10647;</span><span style="color: #cea2ca;">1</span> <span style="color: #d24b83;">&#8278;c</span><span style="color: #9d81ba;">&#10648;</span>
   <span style="color: #9d81ba;">&#10647;</span><span style="color: #cea2ca;">2</span> <span style="color: #d24b83;">&#8278;a</span><span style="color: #9d81ba;">&#10648;</span> <span style="color: #9d81ba;">&#10647;</span><span style="color: #cea2ca;">2</span> <span style="color: #d24b83;">&#8278;b</span><span style="color: #9d81ba;">&#10648;</span> <span style="color: #9d81ba;">&#10647;</span><span style="color: #cea2ca;">2</span> <span style="color: #d24b83;">&#8278;c</span><span style="color: #9d81ba;">&#10648;</span>
   <span style="color: #9d81ba;">&#10647;</span><span style="color: #cea2ca;">3</span> <span style="color: #d24b83;">&#8278;a</span><span style="color: #9d81ba;">&#10648;</span> <span style="color: #9d81ba;">&#10647;</span><span style="color: #cea2ca;">3</span> <span style="color: #d24b83;">&#8278;b</span><span style="color: #9d81ba;">&#10648;</span> <span style="color: #9d81ba;">&#10647;</span><span style="color: #cea2ca;">3</span> <span style="color: #d24b83;">&#8278;c</span><span style="color: #9d81ba;">&#10648;</span><span style="color: #807f96;">&#10648;</span>
</pre>
</div>

<p>
inner-product
</p>

<div class="org-src-container">
<pre class="src src-modulus">&gt; <span style="color: #807f96;">&#10647;</span><span style="color: #cea2ca;">1</span> <span style="color: #cea2ca;">2</span> <span style="color: #cea2ca;">3</span><span style="color: #807f96;">&#10648;</span> <span style="color: #807f96;">&#10216;</span>&#8857; ,<span style="color: #807f96;">&#10217;</span> <span style="color: #807f96;">&#10647;</span><span style="color: #d24b83;">&#8278;a</span> <span style="color: #d24b83;">&#8278;b</span> <span style="color: #d24b83;">&#8278;c</span><span style="color: #807f96;">&#10648;</span>
<span style="color: #807f96;">&#10647;</span><span style="color: #9d81ba;">(</span><span style="color: #cea2ca;">1</span>, <span style="color: #d24b83;">&#8278;a</span><span style="color: #9d81ba;">)</span> <span style="color: #9d81ba;">(</span><span style="color: #cea2ca;">2</span>, <span style="color: #d24b83;">&#8278;b</span><span style="color: #9d81ba;">)</span> <span style="color: #9d81ba;">(</span><span style="color: #cea2ca;">3</span>, <span style="color: #d24b83;">&#8278;c</span><span style="color: #9d81ba;">)</span><span style="color: #807f96;">&#10648;</span>
</pre>
</div>

<p>
outer-product
</p>

<div class="org-src-container">
<pre class="src src-modulus"><span style="color: #807f96;">&#10647;</span><span style="color: #cea2ca;">1</span> <span style="color: #cea2ca;">2</span> <span style="color: #cea2ca;">3</span><span style="color: #807f96;">&#10648;</span> <span style="color: #807f96;">&#10216;</span>&#9673; ,<span style="color: #807f96;">&#10217;</span> <span style="color: #807f96;">&#10647;</span><span style="color: #d24b83;">&#8278;a</span> <span style="color: #d24b83;">&#8278;b</span> <span style="color: #d24b83;">&#8278;c</span><span style="color: #807f96;">&#10648;</span>
&gt; <span style="color: #807f96;">&#10647;</span><span style="color: #9d81ba;">&#10647;</span><span style="color: #cea2ca;">1</span> <span style="color: #d24b83;">&#8278;a</span><span style="color: #9d81ba;">&#10648;</span> <span style="color: #9d81ba;">&#10647;</span><span style="color: #cea2ca;">1</span> <span style="color: #d24b83;">&#8278;b</span><span style="color: #9d81ba;">&#10648;</span> <span style="color: #9d81ba;">&#10647;</span><span style="color: #cea2ca;">1</span> <span style="color: #d24b83;">&#8278;c</span><span style="color: #9d81ba;">&#10648;</span>
   <span style="color: #9d81ba;">&#10647;</span><span style="color: #cea2ca;">2</span> <span style="color: #d24b83;">&#8278;a</span><span style="color: #9d81ba;">&#10648;</span> <span style="color: #9d81ba;">&#10647;</span><span style="color: #cea2ca;">2</span> <span style="color: #d24b83;">&#8278;b</span><span style="color: #9d81ba;">&#10648;</span> <span style="color: #9d81ba;">&#10647;</span><span style="color: #cea2ca;">2</span> <span style="color: #d24b83;">&#8278;c</span><span style="color: #9d81ba;">&#10648;</span>
   <span style="color: #9d81ba;">&#10647;</span><span style="color: #cea2ca;">3</span> <span style="color: #d24b83;">&#8278;a</span><span style="color: #9d81ba;">&#10648;</span> <span style="color: #9d81ba;">&#10647;</span><span style="color: #cea2ca;">3</span> <span style="color: #d24b83;">&#8278;b</span><span style="color: #9d81ba;">&#10648;</span> <span style="color: #9d81ba;">&#10647;</span><span style="color: #cea2ca;">3</span> <span style="color: #d24b83;">&#8278;c</span><span style="color: #9d81ba;">&#10648;</span><span style="color: #807f96;">&#10648;</span>
</pre>
</div>
</div>
</div>
</div>
</div>
</body>
</html>
